TASK 1

    Database Creation:
        Create a new SQLite database named roster.db.
        Define a table called Roster with the following schema:
            Name: TEXT
            Species: TEXT
            Age: INTEGER

    Insert Data:
        Populate the Roster table with the following entries:

Name 	Species 	Age
Benjamin Sisko 	Human 	40
Jadzia Dax 	Trill 	300
Kira Nerys 	Bajoran 	29

    Update Data:
        Update the Name of Jadzia Dax to Ezri Dax.

    Query Data:
        Retrieve and display the Name and Age of all characters where the Species is Bajoran.

    Delete Data:
        Remove all characters aged over 100 years from the table.

    Bonus Task:
        Add a new column called Rank to the Roster table and update the data with the following values:

Name 	Rank
Benjamin Sisko 	Captain
Ezri Dax 	Lieutenant
Kira Nerys 	Major

    Advanced Query:
        Retrieve all characters sorted by their Age in descending order.

In [199]:
create="""
    Create Table Roster1(Name text, Species text, Age int)
"""

insert="""
    Insert into Roster1 Values('Benjamin Sisko','Human', 40),('Jadzia Dax', 'Trill', 300),('Kira Nerys','Bajoran',29)
"""

In [183]:
import sqlite3

with sqlite3.connect('roster1.db') as c:
    cursor=c.cursor()
    cursor.execute(create)
    cursor.execute(insert)

Update Data:
        Update the Name of Jadzia Dax to Ezri Dax.

In [ ]:
with sqlite3.connect('roster1.db') as c:
    cursor=c.cursor()
    cursor.execute("UPDATE Roster1 SET Name='Ezri Dax' WHERE Name='Jadzia Dax'")

Query Data:
        Retrieve and display the Name and Age of all characters where the Species is Bajoran.

In [202]:
with sqlite3.connect('roster1.db') as con:
    cursor=con.cursor()
    data=cursor.execute("SELECT Name, Age from Roster1 WHERE Species='Bajoran'")
data.fetchall()

[('Kira Nerys', 29)]

    Delete Data:
        Remove all characters aged over 100 years from the table.

In [204]:
with sqlite3.connect('roster1.db') as c:
    cursor=c.cursor()
    cursor.execute("DELETE from Roster1 WHERE age>100")

Bonus Task:
        Add a new column called Rank to the Roster table and update the data with the following values:

Name 	Rank
Benjamin Sisko 	Captain
Ezri Dax 	Lieutenant
Kira Nerys 	Major

    Advanced Query:
        Retrieve all characters sorted by their Age in descending order.

In [206]:
with sqlite3.connect('roster1.db') as c:
    cursor=c.cursor()
    cursor.execute("ALTER TABLE Roster1 ADD column Rank")

In [208]:
with sqlite3.connect('roster1.db') as c:
    cursor=c.cursor()
    cursor.execute("UPDATE Roster1 SET Rank='Captain' WHERE Name='Benjamin Sisko'")
    cursor.execute("UPDATE Roster1 SET Rank='Lieutenant' WHERE Name='Ezri Dax'")
    cursor.execute("UPDATE Roster1 SET Rank='Major' WHERE Name='Kira Nerys'")

In [211]:
insert="""
    Insert into Roster1 Values('Ezri Dax','Trill', '300','Lieutenant')
"""

In [212]:
with sqlite3.connect('roster1.db') as c:
    cursor=c.cursor()
    cursor.execute(insert)

In [226]:
with sqlite3.connect('roster1.db') as c:
    cursor=c.cursor()
    query="Select * from Roster1 order by age desc"
    data=cursor.execute(query)
data.fetchall()

[('Ezri Dax', 'Trill', 300, 'Lieutenant'),
 ('Benjamin Sisko', 'Human', 40, 'Captain'),
 ('Kira Nerys', 'Bajoran', 29, 'Major')]

Task 2

    Database Creation:
        Create a new SQLite database named library.db.
        Define a table called Books with the following schema:
            Title: TEXT
            Author: TEXT
            Year_Published: INTEGER
            Genre: TEXT

    Insert Data:
        Populate the Books table with the following entries:

Title 	Author 	Year_Published 	Genre
To Kill a Mockingbird 	Harper Lee 	1960 	Fiction
1984 	George Orwell 	1949 	Dystopian
The Great Gatsby 	F. Scott Fitzgerald 	1925 	Classic

    Update Data:
        Update the Year_Published of 1984 to 1950.

    Query Data:
        Retrieve and display the Title and Author of all books where the Genre is Dystopian.

    Delete Data:
        Remove all books published before the year 1950 from the table.

    Bonus Task:
        Add a new column called Rating to the Books table and update the data with the following values:

Title 	Rating
To Kill a Mockingbird 	4.8
1984 	4.7
The Great Gatsby 	4.5

    Advanced Query:
        Retrieve all books sorted by their Year_Published in ascending order.

Database Creation:
        Create a new SQLite database named library.db.
        Define a table called Books with the following schema:
            Title: TEXT
            Author: TEXT
            Year_Published: INTEGER
            Genre: TEXT

    Insert Data:
        Populate the Books table with the following entries:

Title 	Author 	Year_Published 	Genre
To Kill a Mockingbird 	Harper Lee 	1960 	Fiction
1984 	George Orwell 	1949 	Dystopian
The Great Gatsby 	F. Scott Fitzgerald 	1925 	Classic

In [227]:
create="""
    Create Table Books(Title text, Author text, Year_Published int, Genre text)
"""
insert="""
    Insert into Books Values('To Kill a Mockingbird','Harper Lee',1960,'Fiction'), ('1984','George Orwell',1949,'Dystopian'),('The Great Gatsby','F. Scott Fitzgerald',1925,'Classic')
"""

In [228]:
with sqlite3.connect('library.db') as c:
    cursor=c.cursor()
    cursor.execute(create)
    cursor.execute(insert)

Update Data:
        Update the Year_Published of 1984 to 1950.

In [230]:
with sqlite3.connect('library.db') as c:
    cursor=c.cursor()
    cursor.execute("UPDATE Books SET Year_Published=1950 WHERE Year_Published=1949")

Delete Data:
        Remove all books published before the year 1950 from the table.

    Bonus Task:
        Add a new column called Rating to the Books table and update the data with the following values:

Title 	Rating
To Kill a Mockingbird 	4.8
1984 	4.7
The Great Gatsby 	4.5

    Advanced Query:
        Retrieve all books sorted by their Year_Published in ascending order.

In [231]:
with sqlite3.connect('library.db') as c:
    cursor=c.cursor()
    cursor.execute("DELETE from Books WHERE Year_Published<1950")

In [232]:
with sqlite3.connect('library.db') as c:
    cursor=c.cursor()
    cursor.execute("ALTER table Books add column 'Rating'")

In [ ]:
with sqlite3.connect('library.db') as c:
    cursor=c.cursor()
    cursor.execute("UPDATE Books SET Rating=4.8 WHERE Title='To Kill a Mockingbird'")
    cursor.execute("UPDATE Books SET Rating=4.7 WHERE Title='1984'")
    cursor.execute("UPDATE Books SET Rating=4.5 WHERE Title='The Great Gatsby'")

In [272]:
insert="""
    INSERT INTO Books (title, author, year_published, genre, rating)
    VALUES ('The Great Gatsby', 'F. Scott Fitzgerald', 1925, 'Classic', 4.5);
"""

In [273]:
with sqlite3.connect('library.db') as c:
    cursor=c.cursor()
    cursor.execute(insert)